Tekla.Structures.Dialog.ErrorDialog
The ErrorDialog class represents the common error dialog for the Open API.

Tekla.Structures.Dialog.ErrorDialog.#ctor(System.String,System.Collections.Generic.List{System.String},Tekla.Structures.Dialog.ErrorDialog.Severity)
Initializes the common error message dialog.
Message: The message to display in the dialog.
Details: The detail text to display in the message dialog.
Severity: The severity of the message.

Tekla.Structures.Dialog.ErrorDialog.Show(System.String,System.String,Tekla.Structures.Dialog.ErrorDialog.Severity)
Shows a new error dialog.
Message: The message to display in the dialog.
Details: The details to display in the dialog.
Severity: The severity of the message.

Tekla.Structures.Dialog.ErrorDialog.Show(System.Exception,Tekla.Structures.Dialog.ErrorDialog.Severity)
Shows a new error dialog.
Ex: The exception to display in the dialog.
Severity: The severity of the exception.
Throws System.ArgumentNullException: Thrown when the Ex parameter is null.

Tekla.Structures.Dialog.ErrorDialog.Show(System.String,System.Collections.Generic.List{System.String},Tekla.Structures.Dialog.ErrorDialog.Severity)
Shows a new error dialog.
Message: The message to display in the dialog.
Details: The details to display in the dialog.
Severity: The severity of the message.
Throws System.ArgumentNullException: Thrown when the Message parameter is null.

Tekla.Structures.Dialog.ErrorDialog.components
Required designer variable.

Tekla.Structures.Dialog.ErrorDialog.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.ErrorDialog.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.